export const ACTIVITY_PERIOD = [
  { key: 1, year: '2022 - 2021' },
  { key: 2, year: '2020 - 2013' },
];

export const ACTIVITY = [
  {
    key: 1,
    year: '2022 - 2021',
    content: [
      {
        period: '2021년 11월 - 현재',
        description:
          '국립 국어원 주관 비윤리적 표현 말뭉치 연구 분석 및 시범 구축 사업',
        role: '프론트 엔드 개발자로 참여',
        detail: [
          '로그인 페이지 개발',
          '회원 가입 페이지 개발',
          '회원 정보 인증 페이지 개발',
          '비윤리적 표현 항목별 평가 페이지 개발',
          '작업자별 진행률 확인 페이지 개발',
          '공지사항 페이지 개발',
        ],
      },
      {
        period: '2021년 11월',
        description: '(주) 미디어 코퍼스로 소속 변경',
      },
      {
        period: '2021년 5월 - 2021년 9월',
        description:
          '국립 국어원 주관 말뭉치 언어의 사회적 인식 조사 분류 사업',
        role: '프론트 엔드 개발자로 참여',
        detail: [
          '로그인 페이지 개발',
          '비밀번호 변경 페이지 개발',
          '말뭉치 라벨링 컨텍스트 메뉴 개발',
          '작업자별 진행률 확인 페이지 개발',
          '파일별 완료율 확인 페이지 게발',
          '완료 파일 검수 페이지 개발',
        ],
      },
      { period: '2021년 4월', description: '긱웍스 에아이이 입사' },
    ],
  },
  {
    key: 2,
    year: '2020 - 2013',
    content: [
      {
        period: '2020년 5월 - 2020년 11월',
        description: '한국품질재단 AI 개발자 양성 과정 수료',
        role: '',
        detail: [],
      },
      {
        period: '2019년 1월 - 2019년 12월',
        description: '나노융합공학과 8대 학생회 과대표',
        role: '',
        detail: [],
      },
      {
        period: '2018년 1월 - 2018년 12월',
        description: '나노융합공학과 9대 학생회 정학생회장',
        role: '',
        detail: [],
      },
      {
        period: '2013년 1월 - 2013년 12월',
        description: '나노융합공학과 2대 학생회 과대표',
        role: '',
        detail: [],
      },
    ],
  },
];
